In [6]:
# This Python 3 environment comes with many helpful analytics libraries installed
# It is defined by the kaggle/python Docker image: https://github.com/kaggle/docker-python
# For example, here's several helpful packages to load

import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

# Input data files are available in the read-only "../input/" directory
# For example, running this (by clicking run or pressing Shift+Enter) will list all files under the input directory

import os
for dirname, _, filenames in os.walk('/kaggle/input'):
    for filename in filenames:
        print(os.path.join(dirname, filename))

# You can write up to 20GB to the current directory (/kaggle/working/) that gets preserved as output when you create a version using "Save & Run All" 
# You can also write temporary files to /kaggle/temp/, but they won't be saved outside of the current session

/kaggle/input/studentdata/data.csv
/kaggle/input/weather-dataset/weather_monitoring_data.csv

In [2]:
import pandas as pd

In [4]:
df = pd.DataFrame({
    'Name': ['A', 'B', 'C'],
    'Age': [23, 25, 21]
})

print(df)

  Name  Age
0    A   23
1    B   25
2    C   21

In [7]:
df2 = pd.read_csv("/kaggle/input/studentdata/data.csv")
print(df2)

   Student_ID   Name  Age  Gender Department  Semester  CGPA  Contact_No  \
0         101   Amit   18    Male        CSE         1   8.2  9876543210
1         102   Riya   19  Female        ECE         3   8.8  9123456780
2         103  Sohan   20    Male         ME         5   7.5  9998887776
3         104  Priya   18  Female        CSE         1   9.1  7894561230
4         105  Rahul   21    Male         IT         2   7.9  9870012345

               Email  Address
0   amit@example.com  Kolkata
1   riya@example.com    Delhi
2  sohan@example.com   Mumbai
3  priya@example.com  Chennai
4  rahul@example.com     Pune

In [8]:
df2.head()

,Student_ID,Name,Age,Gender,Department,Semester,CGPA,Contact_No,Email,Address
0,101,Amit,18,Male,CSE,1,8.2,9876543210,amit@example.com,Kolkata
1,102,Riya,19,Female,ECE,3,8.8,9123456780,riya@example.com,Delhi
2,103,Sohan,20,Male,ME,5,7.5,9998887776,sohan@example.com,Mumbai
3,104,Priya,18,Female,CSE,1,9.1,7894561230,priya@example.com,Chennai
4,105,Rahul,21,Male,IT,2,7.9,9870012345,rahul@example.com,Pune

In [9]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Student_ID  5 non-null      int64
 1   Name        5 non-null      object
 2   Age         5 non-null      int64
 3   Gender      5 non-null      object
 4   Department  5 non-null      object
 5   Semester    5 non-null      int64
 6   CGPA        5 non-null      float64
 7   Contact_No  5 non-null      int64
 8   Email       5 non-null      object
 9   Address     5 non-null      object
dtypes: float64(1), int64(4), object(5)
memory usage: 532.0+ bytes

In [10]:
df2.describe()

       Student_ID       Age  Semester     CGPA    Contact_No
count    5.000000   5.00000   5.00000  5.00000  5.000000e+00
mean   103.000000  19.20000   2.40000  8.30000  9.352692e+09
std      1.581139   1.30384   1.67332  0.65192  8.857629e+08
min    101.000000  18.00000   1.00000  7.50000  7.894561e+09
25%    102.000000  18.00000   1.00000  7.90000  9.123457e+09
50%    103.000000  19.00000   2.00000  8.20000  9.870012e+09
75%    104.000000  20.00000   3.00000  8.80000  9.876543e+09
max    105.000000  21.00000   5.00000  9.10000  9.998888e+09

In [15]:
df2.shape

(5, 10)

In [18]:
df2.columns

Index(['Student_ID', 'Name', 'Age', 'Gender', 'Department', 'Semester', 'CGPA',
       'Contact_No', 'Email', 'Address'],
      dtype='object')

In [19]:
df2.index

RangeIndex(start=0, stop=5, step=1)

In [23]:
df3=df2['Name']
print(df3)

0     Amit
1     Riya
2    Sohan
3    Priya
4    Rahul
Name: Name, dtype: object

In [27]:
#df2.loc[2]          # By label
#df2.iloc[2]         # By index
df2.loc[2:5]        # Slice rows

,Student_ID,Name,Age,Gender,Department,Semester,CGPA,Contact_No,Email,Address
2,103,Sohan,20,Male,ME,5,7.5,9998887776,sohan@example.com,Mumbai
3,104,Priya,18,Female,CSE,1,9.1,7894561230,priya@example.com,Chennai
4,105,Rahul,21,Male,IT,2,7.9,9870012345,rahul@example.com,Pune

In [35]:
df5=df2[(df2['Age'] > 20) & (df2['Age']<25)]
print(df5)

   Student_ID   Name  Age Gender Department  Semester  CGPA  Contact_No  \
4         105  Rahul   21   Male         IT         2   7.9  9870012345

               Email Address
4  rahul@example.com    Pune

In [41]:
df2['new_col'] = df2['Age'] + 5


print(df2)

   Student_ID   Name  Age  Gender Department  Semester  CGPA  Contact_No  \
0         101   Amit   30    Male        CSE         1   8.2  9876543210
1         102   Riya   19  Female        ECE         3   8.8  9123456780
2         103  Sohan   20    Male         ME         5   7.5  9998887776
3         104  Priya   18  Female        CSE         1   9.1  7894561230
4         105  Rahul   21    Male         IT         2   7.9  9870012345

               Email  Address  new_col
0   amit@example.com  Kolkata       35
1   riya@example.com    Delhi       24
2  sohan@example.com   Mumbai       25
3  priya@example.com  Chennai       23
4  rahul@example.com     Pune       26

In [44]:
df2["new_col"] = df2["Age"] + 5
print(df2)

   Student_ID   Name  Age  Gender Department  Semester  CGPA  Contact_No  \
0         101   Amit   30    Male        CSE         1   8.2  9876543210
1         102   Riya   19  Female        ECE         3   8.8  9123456780
2         103  Sohan   20    Male         ME         5   7.5  9998887776
3         104  Priya   18  Female        CSE         1   9.1  7894561230
4         105  Rahul   21    Male         IT         2   7.9  9870012345

               Email  Address  new_col
0   amit@example.com  Kolkata       35
1   riya@example.com    Delhi       24
2  sohan@example.com   Mumbai       25
3  priya@example.com  Chennai       23
4  rahul@example.com     Pune       26

In [45]:
df2.loc[0, "Age"] = 30     # Update Amitâ€™s age to 30
print(df2)

   Student_ID   Name  Age  Gender Department  Semester  CGPA  Contact_No  \
0         101   Amit   30    Male        CSE         1   8.2  9876543210
1         102   Riya   19  Female        ECE         3   8.8  9123456780
2         103  Sohan   20    Male         ME         5   7.5  9998887776
3         104  Priya   18  Female        CSE         1   9.1  7894561230
4         105  Rahul   21    Male         IT         2   7.9  9870012345

               Email  Address  new_col
0   amit@example.com  Kolkata       35
1   riya@example.com    Delhi       24
2  sohan@example.com   Mumbai       25
3  priya@example.com  Chennai       23
4  rahul@example.com     Pune       26

In [46]:
df2.drop("new_col", axis=1, inplace=True)
print(df2)

   Student_ID   Name  Age  Gender Department  Semester  CGPA  Contact_No  \
0         101   Amit   30    Male        CSE         1   8.2  9876543210
1         102   Riya   19  Female        ECE         3   8.8  9123456780
2         103  Sohan   20    Male         ME         5   7.5  9998887776
3         104  Priya   18  Female        CSE         1   9.1  7894561230
4         105  Rahul   21    Male         IT         2   7.9  9870012345

               Email  Address
0   amit@example.com  Kolkata
1   riya@example.com    Delhi
2  sohan@example.com   Mumbai
3  priya@example.com  Chennai
4  rahul@example.com     Pune

In [49]:
df2.drop([0, 3], axis=0)
print(df2)

   Student_ID   Name  Age  Gender Department  Semester  CGPA  Contact_No  \
0         101   Amit   30    Male        CSE         1   8.2  9876543210
1         102   Riya   19  Female        ECE         3   8.8  9123456780
2         103  Sohan   20    Male         ME         5   7.5  9998887776
3         104  Priya   18  Female        CSE         1   9.1  7894561230
4         105  Rahul   21    Male         IT         2   7.9  9870012345

               Email  Address
0   amit@example.com  Kolkata
1   riya@example.com    Delhi
2  sohan@example.com   Mumbai
3  priya@example.com  Chennai
4  rahul@example.com     Pune

In [50]:
df6=df2

In [51]:
print(df6)

   Student_ID   Name  Age  Gender Department  Semester  CGPA  Contact_No  \
0         101   Amit   30    Male        CSE         1   8.2  9876543210
1         102   Riya   19  Female        ECE         3   8.8  9123456780
2         103  Sohan   20    Male         ME         5   7.5  9998887776
3         104  Priya   18  Female        CSE         1   9.1  7894561230
4         105  Rahul   21    Male         IT         2   7.9  9870012345

               Email  Address
0   amit@example.com  Kolkata
1   riya@example.com    Delhi
2  sohan@example.com   Mumbai
3  priya@example.com  Chennai
4  rahul@example.com     Pune

In [59]:
df2.head()

,Student_ID,Name,Age,Gender,Department,Semester,CGPA,Contact_No,Email,Address
0,102,Riya,19,Female,ECE,3,8.8,9123456780,riya@example.com,Delhi
1,103,Sohan,20,Male,ME,5,7.5,9998887776,sohan@example.com,Mumbai
2,105,Rahul,21,Male,IT,2,7.9,9870012345,rahul@example.com,Pune

In [60]:
print(df2)

   Student_ID   Name  Age  Gender Department  Semester  CGPA  Contact_No  \
0         102   Riya   19  Female        ECE         3   8.8  9123456780
1         103  Sohan   20    Male         ME         5   7.5  9998887776
2         105  Rahul   21    Male         IT         2   7.9  9870012345

               Email Address
0   riya@example.com   Delhi
1  sohan@example.com  Mumbai
2  rahul@example.com    Pune

In [67]:
df2=pd.read_csv('/kaggle/input/studentdata/data.csv')

In [62]:
df2.head()

,Student_ID,Name,Age,Gender,Department,Semester,CGPA,Contact_No,Email,Address
0,101,Amit,18,Male,CSE,1,8.2,9876543210,amit@example.com,Kolkata
1,102,Riya,19,Female,ECE,3,8.8,9123456780,riya@example.com,Delhi
2,103,Sohan,20,Male,ME,5,7.5,9998887776,sohan@example.com,Mumbai
3,104,Priya,18,Female,CSE,1,9.1,7894561230,priya@example.com,Chennai
4,105,Rahul,21,Male,IT,2,7.9,9870012345,rahul@example.com,Pune

In [63]:
df6=df2

In [64]:

df6.drop([0, 3], axis=0, inplace=True)

In [65]:
df6.head()

,Student_ID,Name,Age,Gender,Department,Semester,CGPA,Contact_No,Email,Address
1,102,Riya,19,Female,ECE,3,8.8,9123456780,riya@example.com,Delhi
2,103,Sohan,20,Male,ME,5,7.5,9998887776,sohan@example.com,Mumbai
4,105,Rahul,21,Male,IT,2,7.9,9870012345,rahul@example.com,Pune

In [68]:
df2.isnull()

,Student_ID,Name,Age,Gender,Department,Semester,CGPA,Contact_No,Email,Address
0,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False

In [69]:
import numpy as np
df2.loc[3, "Name"] = np.nan

In [70]:
print(df2)

   Student_ID   Name  Age  Gender Department  Semester  CGPA  Contact_No  \
0         101   Amit   18    Male        CSE         1   8.2  9876543210
1         102   Riya   19  Female        ECE         3   8.8  9123456780
2         103  Sohan   20    Male         ME         5   7.5  9998887776
3         104    NaN   18  Female        CSE         1   9.1  7894561230
4         105  Rahul   21    Male         IT         2   7.9  9870012345

               Email  Address
0   amit@example.com  Kolkata
1   riya@example.com    Delhi
2  sohan@example.com   Mumbai
3  priya@example.com  Chennai
4  rahul@example.com     Pune

In [71]:
df2.isnull()

,Student_ID,Name,Age,Gender,Department,Semester,CGPA,Contact_No,Email,Address
0,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False
3,False,True,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False

In [72]:
df7=df2

In [73]:
print(df7)

   Student_ID   Name  Age  Gender Department  Semester  CGPA  Contact_No  \
0         101   Amit   18    Male        CSE         1   8.2  9876543210
1         102   Riya   19  Female        ECE         3   8.8  9123456780
2         103  Sohan   20    Male         ME         5   7.5  9998887776
3         104    NaN   18  Female        CSE         1   9.1  7894561230
4         105  Rahul   21    Male         IT         2   7.9  9870012345

               Email  Address
0   amit@example.com  Kolkata
1   riya@example.com    Delhi
2  sohan@example.com   Mumbai
3  priya@example.com  Chennai
4  rahul@example.com     Pune

In [74]:
df7.dropna()#drop row

,Student_ID,Name,Age,Gender,Department,Semester,CGPA,Contact_No,Email,Address
0,101,Amit,18,Male,CSE,1,8.2,9876543210,amit@example.com,Kolkata
1,102,Riya,19,Female,ECE,3,8.8,9123456780,riya@example.com,Delhi
2,103,Sohan,20,Male,ME,5,7.5,9998887776,sohan@example.com,Mumbai
4,105,Rahul,21,Male,IT,2,7.9,9870012345,rahul@example.com,Pune

In [75]:
print(df2)

   Student_ID   Name  Age  Gender Department  Semester  CGPA  Contact_No  \
0         101   Amit   18    Male        CSE         1   8.2  9876543210
1         102   Riya   19  Female        ECE         3   8.8  9123456780
2         103  Sohan   20    Male         ME         5   7.5  9998887776
3         104    NaN   18  Female        CSE         1   9.1  7894561230
4         105  Rahul   21    Male         IT         2   7.9  9870012345

               Email  Address
0   amit@example.com  Kolkata
1   riya@example.com    Delhi
2  sohan@example.com   Mumbai
3  priya@example.com  Chennai
4  rahul@example.com     Pune

In [76]:
df2.fillna(0)

,Student_ID,Name,Age,Gender,Department,Semester,CGPA,Contact_No,Email,Address
0,101,Amit,18,Male,CSE,1,8.2,9876543210,amit@example.com,Kolkata
1,102,Riya,19,Female,ECE,3,8.8,9123456780,riya@example.com,Delhi
2,103,Sohan,20,Male,ME,5,7.5,9998887776,sohan@example.com,Mumbai
3,104,0,18,Female,CSE,1,9.1,7894561230,priya@example.com,Chennai
4,105,Rahul,21,Male,IT,2,7.9,9870012345,rahul@example.com,Pune

In [77]:
df2.fillna("subha")

,Student_ID,Name,Age,Gender,Department,Semester,CGPA,Contact_No,Email,Address
0,101,Amit,18,Male,CSE,1,8.2,9876543210,amit@example.com,Kolkata
1,102,Riya,19,Female,ECE,3,8.8,9123456780,riya@example.com,Delhi
2,103,Sohan,20,Male,ME,5,7.5,9998887776,sohan@example.com,Mumbai
3,104,subha,18,Female,CSE,1,9.1,7894561230,priya@example.com,Chennai
4,105,Rahul,21,Male,IT,2,7.9,9870012345,rahul@example.com,Pune

In [87]:
import numpy as np
df2.loc[3, "Name"] = np.nan

In [79]:
print(df2)

   Student_ID   Name  Age  Gender Department  Semester  CGPA  Contact_No  \
0         101   Amit   18    Male        CSE         1   8.2  9876543210
1         102   Riya   19  Female        ECE         3   8.8  9123456780
2         103  Sohan   20    Male         ME         5   7.5  9998887776
3         104    NaN   18  Female        CSE         1   9.1  7894561230
4         105  Rahul   21    Male         IT         2   7.9  9870012345

               Email  Address
0   amit@example.com  Kolkata
1   riya@example.com    Delhi
2  sohan@example.com   Mumbai
3  priya@example.com  Chennai
4  rahul@example.com     Pune

In [89]:
df2["Department"].fillna("CSE")

0    CSE
1    ECE
2    ECE
3    CSE
4     IT
Name: Department, dtype: object

In [81]:
print(df2)

   Student_ID   Name  Age  Gender Department  Semester  CGPA  Contact_No  \
0         101   Amit   18    Male        CSE         1   8.2  9876543210
1         102   Riya   19  Female        ECE         3   8.8  9123456780
2         103  Sohan   20    Male        NaN         5   7.5  9998887776
3         104    NaN   18  Female        CSE         1   9.1  7894561230
4         105  Rahul   21    Male         IT         2   7.9  9870012345

               Email  Address
0   amit@example.com  Kolkata
1   riya@example.com    Delhi
2  sohan@example.com   Mumbai
3  priya@example.com  Chennai
4  rahul@example.com     Pune

In [85]:
print(df2)

   Student_ID   Name  Age  Gender Department  Semester  CGPA  Contact_No  \
0         101   Amit   18    Male        CSE         1   8.2  9876543210
1         102   Riya   19  Female        ECE         3   8.8  9123456780
2         103  Sohan   20    Male        ECE         5   7.5  9998887776
3         104    NaN   18  Female        CSE         1   9.1  7894561230
4         105  Rahul   21    Male         IT         2   7.9  9870012345

               Email  Address
0   amit@example.com  Kolkata
1   riya@example.com    Delhi
2  sohan@example.com   Mumbai
3  priya@example.com  Chennai
4  rahul@example.com     Pune